#include "inter.h"

void start(void)
{
    setlocale(0, "C");
    char a[14][56] = { { 219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219 },
    { 219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,' ',219,219,' ',219,219,' ',' ',219,219,' ',' ',' ',219,' ',219,219,' ',219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219 },
    { 219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,' ',' ',' ',' ',219,' ',219,219,' ',219,219,' ',219,219,' ',219,219,' ',219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219 },
    { 219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,' ',219,219,' ',219,' ',' ',' ',' ',219,219,' ',219,219,' ',' ',' ',' ',219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219 ,219,219,219,219,219,219 },
    { 219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,' ',219,219,' ',219,' ',219,219,' ',219,219,' ',219,219,' ',219,219,' ',219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219 ,219,219,219,219,219,219 },
    { 219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,' ',219,219,' ',219,' ',219,219,' ',219,219,' ',219,219,' ',219,219,' ',219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219 },
    { 219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219 },
    { 219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219 },
    { 219,' ',219,' ',219,219,' ',219,' ',' ',' ',219,' ',' ',' ',' ',219,' ',' ',' ',219,219,' ',' ',' ',219,219,' ',' ',' ',' ',219,' ',' ',' ',219,219,' ',' ',219,219,' ',' ',' ',219,219,' ',' ',219,219,' ',' ',' ',219,219,219 },
    { 219,' ',219,' ',219,219,' ',219,219,' ',219,219,' ',219,219,219,219,' ',219,219,' ',219,' ',219,219,' ',219,' ',219,219,219,219,219,' ',219,219,' ',219,219,' ',219,219,' ',219,219,' ',219,219,' ',219,' ',219,219,' ',219,219 },
    { 219,' ',219,' ',' ',219,' ',219,219,' ',219,219,' ',' ',' ',219,219,' ',' ',' ',219,219,' ',' ',' ',219,219,' ',' ',' ',219,219,219,' ',219,219,' ',' ',' ',' ',219,219,' ',219,219,' ',219,219,' ',219,' ',' ',' ',219,219,219 },
    { 219,' ',219,' ',219,' ',' ',219,219,' ',219,219,' ',219,219,219,219,' ',219,219,219,219,' ',219,' ',219,219,' ',219,219,219,219,219,' ',219,219,' ',219,219,' ',219,219,' ',219,219,' ',219,219,' ',219,' ',219,' ',219,219,219 },
    { 219,' ',219,' ',219,219,' ',219,219,' ',219,219,' ',' ',' ',' ',219,' ',219,219,219,219,' ',219,219,' ',219,' ',' ',' ',' ',219,219,' ',219,219,' ',219,219,' ',219,219,' ',219,219,219,' ',' ',219,219,' ',219,219,' ',219,219 },
    { 219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219,219 } };
    for (int i = 0; i < 14; i++)
    {
        for (int j = 0; j < 56; j++)
        {
            printf("%c", a[i][j]);
        }
        printf("\n");
    }
    printf("\n\n\n");
}
void instruct1(void)
{
    system("cls");
    start();
    setlocale(0, "");
    printf("Нажмите:\n"
        "1) Для ввода формулы вручную.\n"
        "2) Для ввода пути к файлу, в котором находится формула.\n"
        "3) Для выхода из программы.\n\n\n");
}
void instruct2(void)
{
    system("cls");
    start();
    setlocale(0, "");
    printf("Нажмите:\n"
        "1) Для ввода формулы без переменных.\n"
        "2)Для ввода формулы с переменными.\n\n\n");
}
void loading(void)
{
    setlocale(0, "C");
    int i = 1;
    while (i <= 20)
    {
        Sleep(100);
        system("cls");
        printf("\n\n\n\n");
        printf("                    Loading...\n\n\n\n");
        printf("               ");
        for (int j = 0; j <= i; j++)
        {
            printf("%c", 219);
        }
        i++;
    }
    system("cls");
    start();
}
void begin(void)
{
    List* sp = NULL;
    Queue* q;
    int ch = 0;
    double r;
    while (ch != 3)
    {
        instruct1();
        scanf("%d", &ch);
        switch (ch)
        {
        case 1:
        {
            int ch1;
            instruct2();
            scanf("%d", &ch1);
            char* str;
            str = (char*)malloc(256);
            if (ch1 == 1)
            {
                system("cls");
                start();
                setlocale(0, "");
                printf("Введите формулу:\n\n");
                scanf("%253s", str);
                q = parcer(str, sp);
                if (q == NULL)
                {
                    printf("Некорректное выражение\n");
                    printf("Нажмите Enter, чтобы вернуться в главное меню...");
                    getchar();
                    getchar();
                    break;
                }
                r = calculate(q);
                loading();
                setlocale(0, "");
                printf("Ответ:\n\n\n");
                printf("%s = %lf\n", str, r);
                printf("Нажмите на любую кнопку.");
                getch();
            }
            if (ch1 == 2)
            {
                system("cls");
                start();
                setlocale(0, "");
                printf("Введите количество переменных:");
                int h;
                scanf("%d", &h);
                char op;
                char val[20];
                getchar();
                for (int j = 0; j < h; j++)
                {

                    printf("Введите имя %d переменной:", j + 1);
                    scanf("%c", &op);
                    getchar();
                    printf("Введите значиние переменной %c:", op);
                    scanf("%s", val);
                    getchar();
                    push_list(&sp, op, val);
                }
                free(val);
                system("cls");
                start();
                setlocale(0, "");
                printf("Введите формулу:\n\n\n");
                scanf("%253s", str);
                q = parcer(str, sp);
                if (q == NULL)
                {
                    printf("Некорректное выражение\n");
                    printf("Нажмите Enter, чтобы вернуться в главное меню...");
                    getchar();
                    getchar();
                    break;
                }
                r = calculate(q);
                loading();
                setlocale(0, "");
                printf("Ответ:\n\n\n");
                printf("%s = %lf\n", str, r);
                printf("Нажмите на любую кнопку.");
                getch();

            }
        }
        break;
        case 2:
            system("cls");
            start();
            setlocale(0, "");
            printf("Введите путь у файлу:\n\n");
            {char* str2;
            str2 = (char*)malloc(256);
            char* str1;
            str1 = (char*)malloc(256);
            scanf("%s", str2);
            FILE* f = NULL;
            f = fopen(str2, "r");
            if (f == NULL)
            {
                system("cls");
                start();
                setlocale(0, "");
                printf("Файл не найден.\n");
                break;
            }
            int a;
            int i = 0;
            while ((*(str1 + i) = getc(f)) != EOF)
            {
                i++;
            }
            *(str1 + i) = '\0';
            q = parcer(str1, sp);
            if (q == NULL)
            {
                printf("Некорректное выражение\n");
                printf("Нажмите Enter, чтобы вернуться в главное меню...");
                getchar();
                getchar();
                break;
            }
            r = calculate(q);
            loading();
            setlocale(0, "");
            printf("Ответ:\n\n\n");
            printf("%s = %lf\n", str1, r);
            printf("Нажмите на любую кнопку.");
            getch();
            }
            break;
        case 3:
            system("cls");
            setlocale(0, "");
            printf("Программа завершена");
            Sleep(500);
            break;
        default:
            system("cls");
            start();
            setlocale(0, "");
            printf("Ошибка.Нажмите любую кнопку.");
            getch();
        }

    }

}
